Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+---------------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                         FILE                                          | NAMESPACE | MESSAGE |
+---------+---------------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/providers.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/variables.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/backend.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/data.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/main.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/outputs.tf   | main      | SUCCESS |
+---------+---------------------------------------------------------------------------------------+-----------+---------+

2024-08-31T00:53:37.946Z [INFO]  Terraform version: 1.4.6
2024-08-31T00:53:37.946Z [INFO]  Go runtime version: go1.19.6
2024-08-31T00:53:37.946Z [INFO]  CLI args: []string{"/atlantis-data/bin/terraform1.4.6", "plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-31T00:53:37.952Z [INFO]  CLI command args: []string{"plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-31T00:53:38.050Z [INFO]  Testing if Service Principal / Client Certificate is applicable for Authentication..
2024-08-31T00:53:38.050Z [INFO]  Testing if Multi Tenant Service Principal / Client Secret is applicable for Authentication..
2024-08-31T00:53:38.050Z [INFO]  Testing if Service Principal / Client Secret is applicable for Authentication..
2024-08-31T00:53:38.050Z [INFO]  Using Service Principal / Client Secret for Authentication
2024-08-31T00:53:38.050Z [INFO]  Getting OAuth config for endpoint https://login.microsoftonline.com/ with  tenant 4cf7eae5-1a2c-460b-b602-1c4654455f6e
2024-08-31T00:53:46.377Z [INFO]  backend/local: starting Plan operation
2024-08-31T00:53:47.395Z [INFO]  provider: configuring client automatic mTLS
2024-08-31T00:53:47.548Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-31T00:53:47.548Z
2024-08-31T00:53:54.145Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-31T00:53:54.145Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.145Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.145Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.145Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.146Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:53:54.180Z [INFO]  provider: configuring client automatic mTLS
2024-08-31T00:53:54.354Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-31T00:53:54.354Z
2024-08-31T00:54:00.545Z [INFO]  backend/local: plan calling Plan
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.547Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.548Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:00.663Z [INFO]  provider: configuring client automatic mTLS
2024-08-31T00:54:00.852Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-31T00:54:00.851Z
2024-08-31T00:54:07.352Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/azurerm\"]" changed the config value, but that value is unused
data.azurerm_subnet.default: Reading...
data.azurerm_private_dns_zone.default: Reading...
data.azurerm_subnet.delegated: Reading...
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.147Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.347Z [WARN]  Provider "registry.terraform.io/hashicorp/azurerm" produced an invalid plan for module.postgresql.azurerm_postgresql_flexible_server.default["backstage-demo"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .auto_grow_enabled: planned value cty.False for a non-computed attribute
      - .geo_redundant_backup_enabled: planned value cty.False for a non-computed attribute
      - .authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-08-31T00:54:17.348Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-31T00:54:17.348Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
2024-08-31T00:54:17.348Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.348Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-31T00:54:17.348Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-31T00:54:17.348Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-31T00:54:17.348Z [INFO]  ReferenceTransformer: reference not found: "local.database"
2024-08-31T00:54:17.349Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.349Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.349Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.349Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-31T00:54:17.349Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
data.azurerm_subnet.default: Read complete after 1s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/virtualNetworks/vnet-demo/subnets/subnet-app]
data.azurerm_private_dns_zone.default: Read complete after 1s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
data.azurerm_subnet.delegated: Read complete after 1s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/virtualNetworks/vnet-demo/subnets/subnet-pg-delegated]
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-31T00:54:17.849Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-31T00:54:17.851Z [INFO]  backend/local: plan operation completed
2024-08-31T00:54:17.851Z [INFO]  backend/local: writing plan output to: /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.postgresql.azurerm_postgresql_flexible_server.default["backstage-demo"] will be created
+ resource "azurerm_postgresql_flexible_server" "default" {
+       administrator_login           = "psqladmin"
+       administrator_password        = (sensitive value)
+       auto_grow_enabled             = false
+       backup_retention_days         = (known after apply)
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = false
+       id                            = (known after apply)
+       location                      = "eastus2"
+       name                          = "backstage-demo"
+       private_dns_zone_id           = (known after apply)
+       public_network_access_enabled = true
+       resource_group_name           = "my-rg"
+       sku_name                      = "GP_Standard_D2s_v3"
+       storage_mb                    = 32768
+       storage_tier                  = "P30"
+       tags                          = {
+           "terraform" = "true"
        }
+       version                       = "14"
+       zone                          = "1"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.default["backstage-demo"] will be created
+ resource "azurerm_postgresql_flexible_server_configuration" "default" {
+       id        = (known after apply)
+       name      = "azure.extensions"
+       server_id = (known after apply)
+       value     = "CUBE,CITEXT,BTREE_GIST"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.default["backstage"] will be created
+ resource "azurerm_postgresql_flexible_server_database" "default" {
+       charset   = "UTF8"
+       collation = "en_US.utf8"
+       id        = (known after apply)
+       name      = "backstage"
+       server_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ pgsq_fqdn                          = (known after apply)
+ pgsq_id                            = (known after apply)

Generating Infracost cost estimates for terraform/staging...

+ curl -s -H 'Accept: application/vnd.github+json' -H 'Authorization: Bearer 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' https://api.github.com/repos/leandromoreirati/backstage-demo/pulls/1
+ jq -r .title
+ export 'INFRACOST_VCS_PULL_REQUEST_TITLE="🔩 Create backstage-demo Azure Postgresql Flexible Server"'
+ ls -l /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json
-rwxrwxrwx    1 root     root         23947 Aug 31 00:54 /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json
+ echo terraform
+ echo /tmp/leandromoreirati-backstage-demo-1/staging-terraform-infracost.json
+ ls -l INFRACOST_OUTPUT
terraform
/tmp/leandromoreirati-backstage-demo-1/staging-terraform-infracost.json
ls: INFRACOST_OUTPUT: No such file or directory
+ infracost breakdown '--path=/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json' '--format=json' '--log-level=debug' '--out-file=/tmp/leandromoreirati-backstage-demo-1/staging-terraform-infracost.json' --no-color
2024-08-31T00:54:35Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-08-31T00:54:35Z DEBUG 'POST' request to '/graphql' using trace_id: '09ef88fd-640d-489d-988f-16db5c90bc19'
2024-08-31T00:54:35Z DEBUG performing request method POST url https://dashboard.api.infracost.io/graphql library=retryablehttp
2024-08-31T00:54:35Z DEBUG Successfully loaded settings from Infracost Cloud result="{CloudEnabled:false ActualCostsEnabled:false UsageAPIEnabled:false TagsAPIEnabled:false PoliciesAPIEnabled:false}"
2024-08-31T00:54:35Z DEBUG 'POST' request to '/graphql' using trace_id: '09ef88fd-640d-489d-988f-16db5c90bc19'
2024-08-31T00:54:35Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2024-08-31T00:54:36Z DEBUG os env 'ATLANTIS_WRITE_GIT_CREDS=true' matched prefix 'ATLANTIS_'
2024-08-31T00:54:36Z DEBUG fetching Atlantis VCS metadata
2024-08-31T00:54:36Z DEBUG could not get local git file changes, failed to get the previous commit to compare the current commit against, this is likely because of a shallow clone in CI error=EOF
2024-08-31T00:54:36Z DEBUG walking path /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json to discover terraform files
2024-08-31T00:54:36Z DEBUG could not get file information for path /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json skipping evaluation error="readdirent /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json: not a directory"
2024-08-31T00:54:36Z DEBUG walking directory at /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json returned a list of possible Terraform projects with length 0
2024-08-31T00:54:36Z ERROR Could not autodetect any projects from path "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json"
2024-08-31T00:54:36Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-08-31T00:54:36Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-08-31T00:54:36Z DEBUG Skipping sending project results since Infracost Cloud upload is not enabled.
2024-08-31T00:54:36Z DEBUG 'POST' request to '/event' using trace_id: '09ef88fd-640d-489d-988f-16db5c90bc19'
2024-08-31T00:54:36Z DEBUG performing request method POST url https://pricing.api.infracost.io/event library=retryablehttp
2024-08-31T00:54:36Z INFO Output saved to /tmp/leandromoreirati-backstage-demo-1/staging-terraform-infracost.json

Update: A new version of Infracost is available: v0.10.37 → v0.10.39
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
2024-08-31T00:54:36Z DEBUG writing 0 objects to filesystem cache
2024-08-31T00:54:36Z DEBUG could not flush pricing API cache to filesystem error="open /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json/.infracost/pricing.gob: not a directory"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://51.8.6.15/lock?id=leandromoreirati%252Fbackstage-demo%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```